the error message changes after I've converted to 0.12:
`An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_image.osrm-image will be created
  + resource "azurerm_image" "osrm-image" {
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "osrm-ssd-v5.22.0"
      + resource_group_name = "packerssd"
      + tags                = (known after apply)
      + zone_resilient      = false

      + data_disk {
          + blob_uri = (known after apply)
          + caching  = "ReadWrite"
          + lun      = 0
          + size_gb  = (known after apply)
        }
      + data_disk {
          + blob_uri = (known after apply)
          + caching  = "ReadOnly"
          + lun      = 1
          + size_gb  = (known after apply)
        }

      + os_disk {
          + blob_uri        = (known after apply)
          + caching         = "ReadWrite"
          + managed_disk_id = (known after apply)
          + os_state        = "Generalized"
          + os_type         = "linux"
          + size_gb         = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_image.osrm-image: Creating...

Error: rpc error: code = Unavailable desc = transport is closing



wf-corporate-terraform/azure on  lrosenman/azure_vpn [!?] took 28s
[I] ➜`